УчетВУправляющихДляГит1/src/AccumulationRegisters/УПЖКХ_НачисленияПоРассрочке/УПЖКХ_НачисленияПоРассрочке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УПЖКХ_НачисленияПоРассрочке</name>
  <resources>
    <name>СуммаНачисления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаявлениеНаРассрочку</name>
    <type>
      <types>DocumentRef.УПЖКХ_ЗаявлениеНаРассрочку</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛицевойСчет</name>
    <type>
      <types>CatalogRef.КВП_ЛицевыеСчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Услуга</name>
    <type>
      <types>CatalogRef.КВП_Услуги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.УПЖКХ_Рассрочка</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МесяцРассрочки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_НачислениеВМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ВидПлатежей</name>
    <type>
      <types>EnumRef.УПЖКХ_ВидыПлатежейРассрочки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_СуммаРассрочки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Удалить_ВидРассрочки</name>
    <type>
      <types>EnumRef.УПЖКХ_ВидыРассрочки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

УчетВУправляющихДляГит1/src/AccumulationRegisters/УПЖКХ_НачисленияПоРассрочке/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

// Формирует пустую таблицу, предназначенную для хранения записей РН "Начисления по рассрочке".
//
Функция СформироватьТаблицуДвиженийРассрочки() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	
	Таблица.Колонки.Добавить("Период",               УПЖКХ_ТиповыеМетодыКлиентСервер.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("Организация",          Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("ЗаявлениеНаРассрочку", Новый ОписаниеТипов("ДокументСсылка.УПЖКХ_ЗаявлениеНаРассрочку"));
	Таблица.Колонки.Добавить("ЛицевойСчет",          Новый ОписаниеТипов("СправочникСсылка.КВП_ЛицевыеСчета"));
	Таблица.Колонки.Добавить("Услуга",               Новый ОписаниеТипов("СправочникСсылка.КВП_Услуги"));
	Таблица.Колонки.Добавить("МесяцРассрочки",       УПЖКХ_ТиповыеМетодыКлиентСервер.ПолучитьОписаниеТиповДаты(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("ВидОперации",          Новый ОписаниеТипов("ПеречислениеСсылка.УПЖКХ_Рассрочка"));
	Таблица.Колонки.Добавить("СуммаНачисления",      Новый ОписаниеТипов("Число"));
	
	Возврат Таблица;
	
КонецФункции // СформироватьТаблицуДвиженийРассрочки()

#КонецОбласти
